src/main/test/supply-chain/3-Calculation/0-Apply Tax/3-Tax Type/0-TC02.02.03_17_Get Tax Type/20-ST_PTE_TC02.02.03_17_Get Tax Type - ST-_FixedPrice/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
               xmlns:ws="http://ws.tim.ikea.com/">
   <soap:Header/>
   <soap:Body>
      <ws:applyTax>
         <arg0>
			         <DocumentId>
				           <SystemSourceId>ICI001</SystemSourceId>
				           <TransactionId/>
			         </DocumentId>
			         <AlternateDocumentId>
				           <CustomField1>TEST</CustomField1>
				           <CustomField2/>
				           <CustomField3/>
				           <CustomField4/>
				           <CustomField5/>
				           <CustomField6/>
				           <CustomField7/>
				           <CustomField8/>
				           <CustomField9/>
				           <CustomField10/>
			         </AlternateDocumentId>
			         <InvoiceLanguage>
				           <LanguageCode/>
				           <LanguageCountryCode/>
			         </InvoiceLanguage>
			         <CommunicationLanguage>
				           <LanguageCode/>
				           <LanguageCountryCode/>
			         </CommunicationLanguage>
			
			         <PriceType>fixed</PriceType>
            <CalculationDecimalPlaces/>
			         <PreviousInvoiceTaxCountry/>
			         <TaxDecisionSet>
				           <TaxDecisionSetId>1</TaxDecisionSetId>
               <SellerTaxIndicator>
                  <TaxIndicatorAbbreviation>MAT_DOM</TaxIndicatorAbbreviation>
                  <TaxIndicatorName/>
                  <TaxIndicatorComment/>
               </SellerTaxIndicator>
               <SellerTaxCountry>MY</SellerTaxCountry>
               <SellerTaxState>NULL</SellerTaxState>
               <BuyerTaxIndicator>
                  <TaxIndicatorAbbreviation>MAT_DOM</TaxIndicatorAbbreviation>
                  <TaxIndicatorName/>
                  <TaxIndicatorComment/>
               </BuyerTaxIndicator>
               <BuyerTaxCountry>MY</BuyerTaxCountry>
               <BuyerTaxState>NULL</BuyerTaxState>
               <CombinedTaxIndicator>DOM</CombinedTaxIndicator>
               <CommercialIndicator>C</CommercialIndicator>
               <SellerTaxRegCountry>NULL</SellerTaxRegCountry>
               <SellerTaxRegState>NULL</SellerTaxRegState>
               <BuyerTaxRegCountry>NULL</BuyerTaxRegCountry>
               <BuyerTaxRegState>NULL</BuyerTaxRegState>


				           <TaxComment>
					             <TaxCommentType/>
					             <TaxCommentText/>
				           </TaxComment>
				           <InvoiceCurrency>
					             <CurrencyCode>EUR</CurrencyCode>
					             <SellerLocalTaxCurrencyCode/>
					             <BuyerLocalTaxCurrencyCode/>
				           </InvoiceCurrency>
				           <LegalTaxCalculationLevel/>
				           <TaxInvoiceLine>
					             <LineNumber>1</LineNumber>
					             <ItemNo>56000000</ItemNo>
					             <ItemType/>
					             <UNSPSC>56000000</UNSPSC>
					             <Classification/>
					             <SubClassification/>
					             <CountryItemClassification/>
					             <GrossAmount>55.00</GrossAmount>

					             <VariableTaxSteeringInput>
						               <ConsignorCountry/>
						               <ConsignorState/>
						               <ConsignorBusinessUnitCode>4905</ConsignorBusinessUnitCode>
						               <ConsignorBusinessUnitType>COM</ConsignorBusinessUnitType>
						               <ConsigneeCountry/>
						               <ConsigneeState/>
						               <ConsigneeBusinessUnitCode>7027</ConsigneeBusinessUnitCode>
						               <ConsigneeBusinessUnitType>COM</ConsigneeBusinessUnitType>
						               <CarrierCountry/>
						               <CarrierState/>
						               <CarrierBusinessUnitCode/>
						               <CarrierBusinessUnitType/>
						               <ShipmentStartCountry/>
						               <ShipmentEndCountry/>
						               <ShipmentStartState/>
						               <ShipmentEndState/>
						               <ServiceRenderedCountry/>
						               <ServiceRenderedState/>
						               <ResalePurpose/>
						               <IsOutBonded/>
						               <IsInBonded/>
						               <TaxPreAlgorithmOutput>
							                 <IsExport/>
							                 <IsImport/>
							                 <IsExported/>
							                 <IsImported/>
						               </TaxPreAlgorithmOutput>
						               <ShippingOfCustomsClearedGoods/>
					             </VariableTaxSteeringInput>
				           </TaxInvoiceLine>

			         </TaxDecisionSet>
			         <TaxDate>
				           <TaxAlgorithmDate>2013-10-01</TaxAlgorithmDate>
				           <TaxCalculationDate/>
			         </TaxDate>
			         <TaxModuleBehaviour>
				           <SkipCalculation>N</SkipCalculation>
				           <SkipDecision>Y</SkipDecision>
			         </TaxModuleBehaviour>
			         <VariableTaxSteeringInput>
				           <ConsignorCountry/>
				           <ConsignorState/>
				           <ConsignorBusinessUnitCode/>
				           <ConsignorBusinessUnitType/>
				           <ConsigneeCountry/>
				           <ConsigneeState/>
				           <ConsigneeBusinessUnitCode/>
				           <ConsigneeBusinessUnitType/>
				           <CarrierCountry/>
				           <CarrierState/>
				           <CarrierBusinessUnitCode/>
				           <CarrierBusinessUnitType/>
				           <ShipmentStartCountry/>
				           <ShipmentEndCountry/>
				           <ShipmentStartState/>
				           <ShipmentEndState/>
				           <ServiceRenderedCountry/>
				           <ServiceRenderedState/>
				           <ResalePurpose>Y</ResalePurpose>
				           <IsOutBonded>N</IsOutBonded>
				           <IsInBonded>N</IsInBonded>
				           <TaxPreAlgorithmOutput>
					             <IsExport>N</IsExport>
					             <IsImport>N</IsImport>
					             <IsExported>N</IsExported>
					             <IsImported>N</IsImported>
				           </TaxPreAlgorithmOutput>
				           <ShippingOfCustomsClearedGoods/>
			         </VariableTaxSteeringInput>
			         <BuyerParty>
				           <Party>
					             <BusinessUnitCode>7027</BusinessUnitCode>
					             <BusinessUnitType>COM</BusinessUnitType>
					             <BusinessUnitName/>
					             <PartyAddress>
						               <AddressType/>
						               <City/>
						               <PostBox/>
						               <Street/>
						               <ZipCode/>
						               <CountryCode>MY</CountryCode>
                     <StateCode>MY10</StateCode>

						               <CountryOfLegalRegistration/>
					             </PartyAddress>
				           </Party>
				           <CustomerID/>
			         </BuyerParty>
			         <SellerParty>
				           <Party>
					             <BusinessUnitCode>4905</BusinessUnitCode>
					             <BusinessUnitType>COM</BusinessUnitType>
					             <BusinessUnitName/>
					             <PartyAddress>
						               <AddressType/>
						               <City/>
						               <PostBox/>
						               <Street/>
						               <ZipCode/>
						               <CountryCode/>
						               <StateCode/>
						               <CountryOfLegalRegistration/>
					             </PartyAddress>
				           </Party>
			         </SellerParty>
			         <TermOfDelivery/>
         </arg0>
      </ws:applyTax>
   </soap:Body>
</soap:Envelope>